06-interFoam/RAS/angledDuct/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    porosityWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       63400;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       65000;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       65400;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2800;
        startFace       65800;
    }
)

// ************************************************************************* //
